#Даны целые положительные числа A и B (A > B). На отрезке длины A 
#размещено максимально возможное количество отрезков длины B (без наложений). 
#Используя операцию деления нацело, найти количество отрезков B, размещенных на 
#отрезке A.
a,b=int(input()),int(input())
a = a / b
print (int(a)) 
